## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_hub.virtual_hub will be created
  + resource "azurerm_virtual_hub" "virtual_hub" {
      + address_prefix                         = "10.200.0.0/22"
      + default_route_table_id                 = (known after apply)
      + hub_routing_preference                 = "ExpressRoute"
      + id                                     = (known after apply)
      + location                               = "eastus2"
      + name                                   = "example-virtualhub"
      + resource_group_name                    = "accern-nwsvcs-prd-eus2-rg"
      + virtual_router_asn                     = (known after apply)
      + virtual_router_auto_scale_min_capacity = 2
      + virtual_router_ips                     = (known after apply)
      + virtual_wan_id                         = (known after apply)
    }

  # azurerm_virtual_wan.virtual_wan will be created
  + resource "azurerm_virtual_wan" "virtual_wan" {
      + allow_branch_to_branch_traffic    = true
      + disable_vpn_encryption            = false
      + id                                = (known after apply)
      + location                          = "eastus2"
      + name                              = "example-virtualwan"
      + office365_local_breakout_category = "None"
      + resource_group_name               = "accern-nwsvcs-prd-eus2-rg"
      + type                              = "Standard"
    }

  # module.vnet_spoke_aks.azurerm_subnet.subnet["aks_snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.200.1.128/25",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "acn-spoke-aks-snet-aks"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = "acn-spoke-aks-vnet"
    }

  # module.vnet_spoke_aks.azurerm_subnet.subnet["appgw_snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.200.1.0/25",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "acn-spoke-aks-snet-appgw"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = "acn-spoke-aks-vnet"
    }

  # module.vnet_spoke_aks.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.200.1.0/24",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "acn-spoke-aks-vnet"
      + resource_group_name = "accern-nwsvcs-prd-eus2-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Application" = "accern-aks"
          + "Environment" = "prod"
          + "ID"          = "00000001"
          + "Owner"       = "Javier.Gaibisso"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>